# Introduction to Pandas package

In [1]:
# Import libraries needed for this turorial
import numpy as np
import pandas as pd

In [2]:
# pandas.Series() is a a one-dimensional ndarray. ie a list
s = pd.Series([1, 2 , 4 ,8, np.nan, 32])

In [3]:
s

0     1.0
1     2.0
2     4.0
3     8.0
4     NaN
5    32.0
dtype: float64

In [4]:
# pandas.DataFrame is a two-dimensional tabular data structure ie Rows and Columns
df = pd.DataFrame(np.random.randn(6, 4), columns=list('ABCD'))

In [5]:
df

          A         B         C         D
0 -0.024310  1.582907  0.075638  0.700297
1 -1.244579 -1.185035 -0.953831 -0.614996
2  0.863559 -0.529079 -1.080563  1.817149
3  1.174159 -0.716803  0.315272  0.023344
4  0.931444 -0.126511  0.093183 -1.017225
5  0.130598  0.331116  0.928512 -0.596544

## Viewing data

In [6]:
# With a dataframe, you can veiw the first x rows or last x rows using "head" and "tail"
df.head(3)

          A         B         C         D
0 -0.024310  1.582907  0.075638  0.700297
1 -1.244579 -1.185035 -0.953831 -0.614996
2  0.863559 -0.529079 -1.080563  1.817149

In [7]:
df.tail(2)

          A         B         C         D
4  0.931444 -0.126511  0.093183 -1.017225
5  0.130598  0.331116  0.928512 -0.596544

In [8]:
# You can view the index column
df.index

RangeIndex(start=0, stop=6, step=1)

In [9]:
# You can view the column names
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

### Note: A fundamental difference between pandas and NumPy: NumPy arrays have one dtype for the entire array, while pandas DataFrames have one dtype per column.

In [10]:
# You can print out a summary of your data using the "describe" function in Pandas
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.305145 -0.107234 -0.103631  0.052004
std    0.894418  0.975734  0.773164  1.053147
min   -1.244579 -1.185035 -1.080563 -1.017225
25%    0.014417 -0.669872 -0.696464 -0.610383
50%    0.497078 -0.327795  0.084411 -0.286600
75%    0.914473  0.216709  0.259750  0.531058
max    1.174159  1.582907  0.928512  1.817149

In [11]:
# You can Transpose your data (ie switch rows with columns) by using the "Transpose" function
df.T

          0         1         2         3         4         5
A -0.024310 -1.244579  0.863559  1.174159  0.931444  0.130598
B  1.582907 -1.185035 -0.529079 -0.716803 -0.126511  0.331116
C  0.075638 -0.953831 -1.080563  0.315272  0.093183  0.928512
D  0.700297 -0.614996  1.817149  0.023344 -1.017225 -0.596544

In [12]:
# You can sort an dataframe by index. 
# Below, axis=0 means sort the rows, axis=1 means sort the columns.
# Below, ascending=True means arrange in ascending order, ascending=Fase means arrange in descending order
df.sort_index(axis=0, ascending=False)

          A         B         C         D
5  0.130598  0.331116  0.928512 -0.596544
4  0.931444 -0.126511  0.093183 -1.017225
3  1.174159 -0.716803  0.315272  0.023344
2  0.863559 -0.529079 -1.080563  1.817149
1 -1.244579 -1.185035 -0.953831 -0.614996
0 -0.024310  1.582907  0.075638  0.700297

In [13]:
# As well as sorting by index, you can sort a dataframe by value
df.sort_values(by="C", ascending=False)

          A         B         C         D
5  0.130598  0.331116  0.928512 -0.596544
3  1.174159 -0.716803  0.315272  0.023344
4  0.931444 -0.126511  0.093183 -1.017225
0 -0.024310  1.582907  0.075638  0.700297
1 -1.244579 -1.185035 -0.953831 -0.614996
2  0.863559 -0.529079 -1.080563  1.817149

## Selecting data

In [14]:
# You can select a single column
df['B']

0    1.582907
1   -1.185035
2   -0.529079
3   -0.716803
4   -0.126511
5    0.331116
Name: B, dtype: float64

In [15]:
# You can select certain rows
df[0:2]
# Note how 0:2 refers to rows 0 and 1. ie 2 means up to, but not including 2 (3rd row)

          A         B         C         D
0 -0.024310  1.582907  0.075638  0.700297
1 -1.244579 -1.185035 -0.953831 -0.614996

### Selecting by label - ".loc" function

In [16]:
# You can use the ".loc" function to locate a specific row
df.loc[3]
# Remember this is the 4th row, because the 1st row is row 0

A    1.174159
B   -0.716803
C    0.315272
D    0.023344
Name: 3, dtype: float64

In [17]:
# You can use the ".loc" function to locate a specific column
df.loc[:, ['A']]

          A
0 -0.024310
1 -1.244579
2  0.863559
3  1.174159
4  0.931444
5  0.130598

In [18]:
# You can use the ".loc" function to locate any number of rows or colums
df.loc[2:4, ['A','C']]

          A         C
2  0.863559 -1.080563
3  1.174159  0.315272
4  0.931444  0.093183

### Selecting by position - ".iloc" function

In [19]:
# You can also select on the basis on position in the dataframe
# Note: this yelds the same as df.loc[3] above
df.iloc[3]

A    1.174159
B   -0.716803
C    0.315272
D    0.023344
Name: 3, dtype: float64

In [20]:
# You can select a certain column
# Note: This doesn't exactly yield the same result as df.loc[:, ['A']] above. The Heading is not included
df.iloc[ : , 0]

0   -0.024310
1   -1.244579
2    0.863559
3    1.174159
4    0.931444
5    0.130598
Name: A, dtype: float64

In [21]:
# You can also select specific parts of the dataframe
# This code does not yiled ths same as "df.loc[2:4, ['A','C']]" above
df.iloc[2:4, 0:2]

          A         B
2  0.863559 -0.529079
3  1.174159 -0.716803

In [22]:
# But the below code DOES yield the same result as "df.loc[2:4, ['A','C']]" above
df.iloc[[2,3,4],[0,2]]

          A         C
2  0.863559 -1.080563
3  1.174159  0.315272
4  0.931444  0.093183

In [23]:
# For slicing rows explicitly
df.iloc[1:3,:]
# Note how the rows are up to, but not including the row number stated.

          A         B         C         D
1 -1.244579 -1.185035 -0.953831 -0.614996
2  0.863559 -0.529079 -1.080563  1.817149

In [24]:
# For slicing columns explicitly
df.iloc[:,1:3]

          B         C
0  1.582907  0.075638
1 -1.185035 -0.953831
2 -0.529079 -1.080563
3 -0.716803  0.315272
4 -0.126511  0.093183
5  0.331116  0.928512

In [25]:
# For getting a value explicity
df.iloc[0,0]

-0.024309742347521385

### Note: Above, it id difficult to see the difference between ".loc" and ".iloc" functions. This is because the default index is 0, 1, 2,3,...... If the index was different (eg hours of a day, where the same nuber may be reappearing later in the dataframe index.
### .loc is used when referencing the index in the dataframe
### .iloc is used when referencing the row number in the dataframe

In [26]:
# If you wish to select certain values from a database. For instance, below will select rows from the database where the
# value in Column A is greter then zero
df[df.A > 0]

          A         B         C         D
2  0.863559 -0.529079 -1.080563  1.817149
3  1.174159 -0.716803  0.315272  0.023344
4  0.931444 -0.126511  0.093183 -1.017225
5  0.130598  0.331116  0.928512 -0.596544

In [27]:
# If you wish to select only data that meets a certain criteria. For instance, below displays only values that are greater
# than zero
df[df > 0]

          A         B         C         D
0       NaN  1.582907  0.075638  0.700297
1       NaN       NaN       NaN       NaN
2  0.863559       NaN       NaN  1.817149
3  1.174159       NaN  0.315272  0.023344
4  0.931444       NaN  0.093183       NaN
5  0.130598  0.331116  0.928512       NaN

In [28]:
# You can copy a DataFrame
df2 = df.copy()

In [29]:
df2

          A         B         C         D
0 -0.024310  1.582907  0.075638  0.700297
1 -1.244579 -1.185035 -0.953831 -0.614996
2  0.863559 -0.529079 -1.080563  1.817149
3  1.174159 -0.716803  0.315272  0.023344
4  0.931444 -0.126511  0.093183 -1.017225
5  0.130598  0.331116  0.928512 -0.596544

In [30]:
# You can enter a new colum into a dataframe
df2['E'] = ['one', 'one', 'two', 'three', 'four', 'three']

In [31]:
df2

          A         B         C         D      E
0 -0.024310  1.582907  0.075638  0.700297    one
1 -1.244579 -1.185035 -0.953831 -0.614996    one
2  0.863559 -0.529079 -1.080563  1.817149    two
3  1.174159 -0.716803  0.315272  0.023344  three
4  0.931444 -0.126511  0.093183 -1.017225   four
5  0.130598  0.331116  0.928512 -0.596544  three

In [32]:
# Using the "isin" function, you can select certain data
df2[df2['E'].isin(['two', 'four'])]

          A         B         C         D     E
2  0.863559 -0.529079 -1.080563  1.817149   two
4  0.931444 -0.126511  0.093183 -1.017225  four

### Setting

In [33]:
# Just to remind ourselves of the dataframe we are using
df

          A         B         C         D
0 -0.024310  1.582907  0.075638  0.700297
1 -1.244579 -1.185035 -0.953831 -0.614996
2  0.863559 -0.529079 -1.080563  1.817149
3  1.174159 -0.716803  0.315272  0.023344
4  0.931444 -0.126511  0.093183 -1.017225
5  0.130598  0.331116  0.928512 -0.596544

In [34]:
# You can set a value in a particular location of a database.
df.at[0,'A'] = 0

In [35]:
df

          A         B         C         D
0  0.000000  1.582907  0.075638  0.700297
1 -1.244579 -1.185035 -0.953831 -0.614996
2  0.863559 -0.529079 -1.080563  1.817149
3  1.174159 -0.716803  0.315272  0.023344
4  0.931444 -0.126511  0.093183 -1.017225
5  0.130598  0.331116  0.928512 -0.596544

In [36]:
# You can alos set a value using the "iat" command
df.iat[1,1] = 0

In [37]:
df

          A         B         C         D
0  0.000000  1.582907  0.075638  0.700297
1 -1.244579  0.000000 -0.953831 -0.614996
2  0.863559 -0.529079 -1.080563  1.817149
3  1.174159 -0.716803  0.315272  0.023344
4  0.931444 -0.126511  0.093183 -1.017225
5  0.130598  0.331116  0.928512 -0.596544

In [38]:
# Finally, you can set an entire column to be a ceratin value
df.loc[:, 'D'] = np.array([5] * len(df))

In [39]:
df

          A         B         C  D
0  0.000000  1.582907  0.075638  5
1 -1.244579  0.000000 -0.953831  5
2  0.863559 -0.529079 -1.080563  5
3  1.174159 -0.716803  0.315272  5
4  0.931444 -0.126511  0.093183  5
5  0.130598  0.331116  0.928512  5

### Missing data

#### pandas primarily uses the value 'np.nan' to represent missing data. It is by default not included in computations. Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data.

In [40]:
# A new column can be inserted
df1 = df.reindex([0,1,2,3,4,5], columns=list(df.columns) + ['E'])

In [41]:
df1

          A         B         C  D   E
0  0.000000  1.582907  0.075638  5 NaN
1 -1.244579  0.000000 -0.953831  5 NaN
2  0.863559 -0.529079 -1.080563  5 NaN
3  1.174159 -0.716803  0.315272  5 NaN
4  0.931444 -0.126511  0.093183  5 NaN
5  0.130598  0.331116  0.928512  5 NaN

In [42]:
# You can set any value(s)  in the dataframe
df1.loc[2:4, 'E'] = 1

In [43]:
df1

          A         B         C  D    E
0  0.000000  1.582907  0.075638  5  NaN
1 -1.244579  0.000000 -0.953831  5  NaN
2  0.863559 -0.529079 -1.080563  5  1.0
3  1.174159 -0.716803  0.315272  5  1.0
4  0.931444 -0.126511  0.093183  5  1.0
5  0.130598  0.331116  0.928512  5  NaN

In [44]:
# You can omit any none-values from the dataframe
df1.dropna(how='any')

          A         B         C  D    E
2  0.863559 -0.529079 -1.080563  5  1.0
3  1.174159 -0.716803  0.315272  5  1.0
4  0.931444 -0.126511  0.093183  5  1.0

In [45]:
# Or you can fill in missing data in a datframe
df1.fillna(value=10)

          A         B         C  D     E
0  0.000000  1.582907  0.075638  5  10.0
1 -1.244579  0.000000 -0.953831  5  10.0
2  0.863559 -0.529079 -1.080563  5   1.0
3  1.174159 -0.716803  0.315272  5   1.0
4  0.931444 -0.126511  0.093183  5   1.0
5  0.130598  0.331116  0.928512  5  10.0

In [46]:
# The 'isna' function gives a boolean check on whether a valu is NaN or not
pd.isna(df1)

       A      B      C      D      E
0  False  False  False  False   True
1  False  False  False  False   True
2  False  False  False  False  False
3  False  False  False  False  False
4  False  False  False  False  False
5  False  False  False  False   True

### Operations

#### Stats

In [47]:
df

          A         B         C  D
0  0.000000  1.582907  0.075638  5
1 -1.244579  0.000000 -0.953831  5
2  0.863559 -0.529079 -1.080563  5
3  1.174159 -0.716803  0.315272  5
4  0.931444 -0.126511  0.093183  5
5  0.130598  0.331116  0.928512  5

In [48]:
# You can get the average on each column
df.mean()

A    0.309197
B    0.090272
C   -0.103631
D    5.000000
dtype: float64

In [49]:
# You can get the average of each row
df.mean(1)

0    1.664636
1    0.700397
2    1.063479
3    1.443157
4    1.474529
5    1.597557
dtype: float64

In [50]:
# cumsum allows you to add the values in a column as you move down through it
df.apply(np.cumsum)

          A         B         C   D
0  0.000000  1.582907  0.075638   5
1 -1.244579  1.582907 -0.878193  10
2 -0.381021  1.053828 -1.958756  15
3  0.793138  0.337025 -1.643484  20
4  1.724583  0.210514 -1.550301  25
5  1.855181  0.541630 -0.621789  30

In [51]:
# You can apply an equation to the dataset. For instance, below prints out the max value in a column minus the min value
df.apply(lambda x: x.max() - x.min())

A    2.418738
B    2.299710
C    2.009075
D    0.000000
dtype: float64

### Merge

#### concat()

In [52]:
# Create a dataframe from numpy.random
df = pd.DataFrame(np.random.randn(10,4))

In [53]:
df

          0         1         2         3
0 -0.181167  0.691585  0.708827  1.602166
1  0.876439 -0.331541 -0.345736  0.656799
2  0.811394  1.377762 -0.782122 -0.149948
3  0.066438 -0.210554  0.269388 -0.744824
4 -1.515820 -0.723395  1.065495  0.201240
5 -0.396845 -0.329352  0.699925  0.839207
6 -1.298721 -0.346419 -0.804705 -0.532884
7 -0.269964  0.185686 -0.989587  1.307830
8  2.227032 -1.488995  1.263716  0.078042
9 -0.029245 -0.310610 -0.330824  0.125356

In [54]:
# You can pick specific pats of this DataFrame
pieces = [df[:3], df[3:7], df[7:]]

In [55]:
pieces

[          0         1         2         3
 0 -0.181167  0.691585  0.708827  1.602166
 1  0.876439 -0.331541 -0.345736  0.656799
 2  0.811394  1.377762 -0.782122 -0.149948,
           0         1         2         3
 3  0.066438 -0.210554  0.269388 -0.744824
 4 -1.515820 -0.723395  1.065495  0.201240
 5 -0.396845 -0.329352  0.699925  0.839207
 6 -1.298721 -0.346419 -0.804705 -0.532884,
           0         1         2         3
 7 -0.269964  0.185686 -0.989587  1.307830
 8  2.227032 -1.488995  1.263716  0.078042
 9 -0.029245 -0.310610 -0.330824  0.125356]

In [56]:
# the "concat" function in pandas allows you to join/merge a dataFrame
pd.concat(pieces)

          0         1         2         3
0 -0.181167  0.691585  0.708827  1.602166
1  0.876439 -0.331541 -0.345736  0.656799
2  0.811394  1.377762 -0.782122 -0.149948
3  0.066438 -0.210554  0.269388 -0.744824
4 -1.515820 -0.723395  1.065495  0.201240
5 -0.396845 -0.329352  0.699925  0.839207
6 -1.298721 -0.346419 -0.804705 -0.532884
7 -0.269964  0.185686 -0.989587  1.307830
8  2.227032 -1.488995  1.263716  0.078042
9 -0.029245 -0.310610 -0.330824  0.125356

In [57]:
# You can concatenate two or more DataFrames
df2 = pd.DataFrame(np.random.randn(20,8))

In [58]:
df2

,0,1,2,3,4,5,6,7
0,0.231755,0.158484,-2.398886,0.544609,1.312135,1.470650,0.353275,0.187248
1,0.340989,0.472346,1.136426,-1.628995,0.782033,-0.143153,-0.088504,-0.162330
2,0.284500,1.035224,0.201958,-0.359452,0.958842,-0.043579,0.935681,-0.674290
3,-0.139612,-0.962591,-0.677343,0.547384,-0.031453,0.343222,0.063205,0.533962
4,-0.497848,-0.059295,-0.365739,-0.662525,-0.593236,-0.462384,-1.034404,0.328175
5,-1.322277,0.180920,-0.330430,0.193508,0.934406,-1.248992,-0.475874,-0.162156
6,-1.222225,0.095572,-0.769178,-1.084608,2.012113,0.291763,-1.145862,-1.850500
7,-0.052910,-0.164268,-0.601804,1.104933,-0.454929,0.064225,-1.912138,2.965936
8,-0.223100,-0.626074,-1.025857,-2.092110,0.595935,0.374247,1.582095,-1.060892
9,0.424006,-0.032651,0.937342,-1.084911,-1.241637,-2.586380,0.407309,0.057579
10,1.555298,1.147214,0.108915,-0.684390,-1.723566,0.445893,-0.139898,0.665293
11,0.113514,0.512184,-0.612496,-0.219462,-0.034535,0.233274,0.268129,0.809942
12,-3.468802,0.383737,-1.203169,-1.175510,-0.426863,0.419989,-1.210569,-0.384611
13,0.170412,0.264590,0.798768,1.666339,0.481958,0.772314,-0.060372,0.111694
14,-0.002295,-0.440476,-0.580848,1.076498,0.948392,-0.229894,-0.153286,-1.388705
15,0.918854,-0.375300,0.399155,0.254363,2.475873,1.543048,-1.168819,-1.280186
16,0.818281,-0.138545,1.410935,-0.460358,-1.778088,0.662032,0.745204,-0.621836
17,0.274205,-0.528537,0.286461,-0.654420,-0.267829,0.237758,-1.237153,-0.540059
18,-0.558921,1.054169,0.423256,-0.286491,-0.887489,0.938594,-0.842347,1.606694
19,-1.015810,0.920312,-1.559286,0.803467,0.151308,0.141957,0.212617,0.392664

In [59]:
# Create an entity called Frames which will contain both df and df1
Frames = [df, df2]

In [60]:
# Now, concatenate Frames
df3 = pd.concat(Frames)

In [61]:
df3

,0,1,2,3,4,5,6,7
0,-0.181167,0.691585,0.708827,1.602166,NaN,NaN,NaN,NaN
1,0.876439,-0.331541,-0.345736,0.656799,NaN,NaN,NaN,NaN
2,0.811394,1.377762,-0.782122,-0.149948,NaN,NaN,NaN,NaN
3,0.066438,-0.210554,0.269388,-0.744824,NaN,NaN,NaN,NaN
4,-1.515820,-0.723395,1.065495,0.201240,NaN,NaN,NaN,NaN
5,-0.396845,-0.329352,0.699925,0.839207,NaN,NaN,NaN,NaN
6,-1.298721,-0.346419,-0.804705,-0.532884,NaN,NaN,NaN,NaN
7,-0.269964,0.185686,-0.989587,1.307830,NaN,NaN,NaN,NaN
8,2.227032,-1.488995,1.263716,0.078042,NaN,NaN,NaN,NaN
9,-0.029245,-0.310610,-0.330824,0.125356,NaN,NaN,NaN,NaN
0,0.231755,0.158484,-2.398886,0.544609,1.312135,1.470650,0.353275,0.187248
1,0.340989,0.472346,1.136426,-1.628995,0.782033,-0.143153,-0.088504,-0.162330
2,0.284500,1.035224,0.201958,-0.359452,0.958842,-0.043579,0.935681,-0.674290
3,-0.139612,-0.962591,-0.677343,0.547384,-0.031453,0.343222,0.063205,0.533962
4,-0.497848,-0.059295,-0.365739,-0.662525,-0.593236,-0.462384,-1.034404,0.328175
5,-1.322277,0.180920,-0.330430,0.193508,0.934406,-1.248992,-0.475874,-0.162156
6,-1.222225,0.095572,-0.769178,-1.084608,2.012113,0.291763,-1.145862,-1.850500
7,-0.052910,-0.164268,-0.601804,1.104933,-0.454929,0.064225,-1.912138,2.965936
8,-0.223100,-0.626074,-1.025857,-2.092110,0.595935,0.374247,1.582095,-1.060892
9,0.424006,-0.032651,0.937342,-1.084911,-1.241637,-2.586380,0.407309,0.057579
10,1.555298,1.147214,0.108915,-0.684390,-1.723566,0.445893,-0.139898,0.665293
11,0.113514,0.512184,-0.612496,-0.219462,-0.034535,0.233274,0.268129,0.809942
12,-3.468802,0.383737,-1.203169,-1.175510,-0.426863,0.419989,-1.210569,-0.384611
13,0.170412,0.264590,0.798768,1.666339,0.481958,0.772314,-0.060372,0.111694
14,-0.002295,-0.440476,-0.580848,1.076498,0.948392,-0.229894,-0.153286,-1.388705
15,0.918854,-0.375300,0.399155,0.254363,2.475873,1.543048,-1.168819,-1.280186
16,0.818281,-0.138545,1.410935,-0.460358,-1.778088,0.662032,0.745204,-0.621836
17,0.274205,-0.528537,0.286461,-0.654420,-0.267829,0.237758,-1.237153,-0.540059
18,-0.558921,1.054169,0.423256,-0.286491,-0.887489,0.938594,-0.842347,1.606694
19,-1.015810,0.920312,-1.559286,0.803467,0.151308,0.141957,0.212617,0.392664

#### Join

In [62]:
pd.merge(df, df2, on=3)

Empty DataFrame
Columns: [0_x, 1_x, 2_x, 3, 0_y, 1_y, 2_y, 4, 5, 6, 7]
Index: []

#### Append

In [63]:
# Rows can be appended to a DataFrame
df

          0         1         2         3
0 -0.181167  0.691585  0.708827  1.602166
1  0.876439 -0.331541 -0.345736  0.656799
2  0.811394  1.377762 -0.782122 -0.149948
3  0.066438 -0.210554  0.269388 -0.744824
4 -1.515820 -0.723395  1.065495  0.201240
5 -0.396845 -0.329352  0.699925  0.839207
6 -1.298721 -0.346419 -0.804705 -0.532884
7 -0.269964  0.185686 -0.989587  1.307830
8  2.227032 -1.488995  1.263716  0.078042
9 -0.029245 -0.310610 -0.330824  0.125356

In [64]:
s = df.iloc[3]

In [65]:
s

0    0.066438
1   -0.210554
2    0.269388
3   -0.744824
Name: 3, dtype: float64

In [66]:
df.append(s, ignore_index=True)

           0         1         2         3
0  -0.181167  0.691585  0.708827  1.602166
1   0.876439 -0.331541 -0.345736  0.656799
2   0.811394  1.377762 -0.782122 -0.149948
3   0.066438 -0.210554  0.269388 -0.744824
4  -1.515820 -0.723395  1.065495  0.201240
5  -0.396845 -0.329352  0.699925  0.839207
6  -1.298721 -0.346419 -0.804705 -0.532884
7  -0.269964  0.185686 -0.989587  1.307830
8   2.227032 -1.488995  1.263716  0.078042
9  -0.029245 -0.310610 -0.330824  0.125356
10  0.066438 -0.210554  0.269388 -0.744824

#### Grouping

In [74]:
# Create a dataframe to best example Grouping
df4 = pd.DataFrame({'A': ['foo', 'bar', 'foo', 'bar', 'foo', 'bar', 'foo', 'foo'], 'B': ['one', 'one', 'two', 'three',
   'two', 'two', 'one', 'three'], 'C': np.random.randn(8), 'D': np.random.randn(8)})

In [75]:
df4

     A      B         C         D
0  foo    one -0.075395  0.464909
1  bar    one -0.372027  2.019898
2  foo    two  0.488530  1.515309
3  bar  three  0.788108 -0.369868
4  foo    two -0.812550  1.257633
5  bar    two  1.087713  0.822314
6  foo    one  0.396967  0.340341
7  foo  three -1.129579  1.368210

In [77]:
# You can group and sum
df4.groupby('A').sum()

            C         D
A
bar  1.503794  2.472344
foo -1.132028  4.946401

In [78]:
# Or, in more detail
df4.groupby(['A', 'B']).sum()

                  C         D
A   B
bar one   -0.372027  2.019898
    three  0.788108 -0.369868
    two    1.087713  0.822314
foo one    0.321571  0.805250
    three -1.129579  1.368210
    two   -0.324020  2.772941

In [80]:
# Pivot tables are used to group and rearrange a dataframe into a more suitable dataframe for your use. eg
df = pd.DataFrame({'A': ['one', 'one', 'two', 'three'] * 3, 'B': ['A', 'B', 'C'] * 4, 'C': ['foo', 'foo', 'foo', 'bar', 'bar',
                'bar'] * 2, 'D': np.random.randn(12), 'E': np.random.randn(12)})

In [81]:
df

        A  B    C         D         E
0     one  A  foo -0.359449 -1.719129
1     one  B  foo  1.450546  1.361366
2     two  C  foo -0.464117  1.069624
3   three  A  bar -0.036947  0.072710
4     one  B  bar -1.051043 -1.312635
5     one  C  bar  0.995431 -0.603778
6     two  A  foo  0.969761 -0.265153
7   three  B  foo -1.334363  0.148412
8     one  C  foo  0.572056 -0.268733
9     one  A  bar -0.068773  0.492434
10    two  B  bar  0.161556 -0.894928
11  three  C  bar  1.386088  1.056326

In [82]:
# Using the "pivot_table" function in pandas you can do somethinglike below with the above table
pd.pivot_table(df, values='D', index=['A', 'B'], columns=['C'])

C             bar       foo
A     B
one   A -0.068773 -0.359449
      B -1.051043  1.450546
      C  0.995431  0.572056
three A -0.036947       NaN
      B       NaN -1.334363
      C  1.386088       NaN
two   A       NaN  0.969761
      B  0.161556       NaN
      C       NaN -0.464117

#### Dealing with time

#### Pandas is very efficient for using with time issues. For example, if you want to adjust youe data from every second to every minute, pandas can do this. Also, for changing time zones, or converting time zones